Repository: grantjenks/free-python-games
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: `Free Python Games`_ is an Apache2 licensed collection of free Python games intended for education and fun. The games are written in simple Python code and designed for experimentation and changes. Simplified versions of several classic arcade games are included.
pt_br: `Free Python Games`_ é uma coleção de jogos gratuita feita em Python destinados à educação e à diversão licenciada com Apache2. Os jogos são escritos em códigos simples de Python e projetados para experimentação e mudanças. Estão inclusas versões simplificadas de vários jogos de arcade clássicos.

source: Python is one of the top-five most popular programming languages in the world and available for free from `Python.org <https://www.python.org/>`_. Python includes an extensive Standard Library distributed with your installation. The Standard Library has a module called Turtle which is a popular way to introduce programming to kids. Turtle was part of the original Logo programming language developed by Wally Feurzig and Seymour Papert in 1966. All of the games in `Free Python Games`_ are implemented using Python and its Turtle module.
pt_br: Python é uma das cinco linguagens de programação mais populares do mundo e está disponível gratuitamente em `Python.org. <https://www.python.org/>`_. Python inclui uma ampla biblioteca padrão distribuída com sua instalação. A biblioteca padrão tem um módulo chamado Turtle, que é uma forma popular de apresentar programação às crianças. Turtle fazia parte da linguagem de programação Logo original, desenvolvida por Wally Feurzig e Seymor Papert em 1966. Todos os jogos em `Free Python Games`_ são implementados usando Python e seu módulo Turtle.

source: Starting in 2012, `Free Python Games`_ began as an after school program to teach programming to inner-city youth. The goal was to have fun as much as it was to learn. Since then the games have been improved and used in a variety of settings ranging from classrooms to summer day-camps.
pt_br: A partir de 2012, `Free Python Games`_ começou como um programa pós-escola para ensinar programação aos jovens do centro da cidade. O objetivo era se divertir tanto quanto aprender. Desde então, os jogos foram melhorados e usados em uma variedade de ambientes que vão de salas de aulas a acampamentos de verão.

source: The games run anywhere Python can be installed which includes desktop computers running Windows, Mac OS, or Linux and older or low-power hardware such as the Raspberry Pi. Kids across the United States in grades 6th-12th have enjoyed learning about topics such as encryption and projectile motion through games.
pt_br: Os jogos são executados em qualquer lugar que o Python possa ser instalado, o que inclui computadores desktop com Windows, Mac OS ou Linux e hardware mais “velhos” e de baixa potência, como Raspberry Pi. Crianças nos Estados Unidos, da 6ª à 12ª série, gostaram de aprender tópicos sobre criptografia e movimento de projétil através dos jogos.

source: Each game is entirely independent from the others and includes comments along with a list of exercises to work through with students. Creativity and flexibility is important. There is no right or wrong way to implement a new feature or behavior! You never know which games students will engage with best.
pt_br: Cada jogo é inteiramente independente dos outros e inclui comentários com uma lista de exercícios para trabalhar com os estudantes. Criatividade e flexibilidade são importantes. Não há forma certa ou errada de implementar uma nova característica ou comportamento! Você nunca sabe com quais jogos os estudantes se engajarão melhor.

source: Testimonials
pt_br: Relatos

source: *"I love Free Python Games because the games are fun and they're easy to understand and change. I like making my own games now."*
pt_br: *"Eu amo Free Python Games porque os jogos são divertidos e eles são fáceis de entender e mudar. Eu gosto de fazer meus próprios jogos agora. "*

source: -- Luke Martin, Student
pt_br: -- Luke Martin, estudante

source: *"Free Python Games inspired and introduced a new hobby to our son. Thank you so much for exposing him to coding. He is having so much fun!"*
pt_br: *"Free Python Games inspirou e introduziu um novo passatempo para o nosso filho. Muito obrigada por apresentar ele à programação. Ele está se divertindo bastante!"*

source: -- Mary Lai, Parent
pt_br: -- Mary Lai, mãe

source: *"Free Python Games are great because they really engage students and let them learn at their own pace."*
pt_br: *"Free Python Games é ótimo por envolver os alunos e permitir que aprendam em seu próprio ritmo."*

source: -- Rick Schertle, Teacher, Steindorf STEAM School
pt_br: -- Rick Schertle, professor da Steindorf STEAM School

source: *"Free Python Games combines play and learning in a flexible environment that reduces the stress of a difficult topic like programming."*
pt_br: *"Free Python Games combina brincadeira e aprendizagem em um ambiente flexível que reduz o estresse de um tópico difícil como a programação."*

source: -- Brett Bymaster, Youth Pastor, The River Church Community
pt_br: -- Brett Bymaster, Pastor de jovens, Comunidade da The River Church

source: *"Free Python Games is great for students, is highly organized and flexible, and seeks to unleash inquiry and understanding."*
pt_br: *"Free Python Games é ótimo para estudantes, é altamente organizado e flexível e procura liberar a investigação e a compreensão."*

source: -- Terri Furton, Principal, Downtown College Prep
pt_br: -- Terri Furton, Diretor da Downton College Prep

source: Features
pt_br: Características

source: Fun to play!
pt_br: Divertido de jogar

source: Simple Python code
pt_br: Código de Python simples

source: Easy to install
pt_br: Fácil de instalar

source: Designed for education
pt_br: Projetado para educação

source: Depends only on the Python Standard Library
pt_br: Depende apenas da biblioteca padrão de Python

source: Used in hundreds of hours of classroom instruction
pt_br: Usado em centenas de horas de instrução em sala de aula

source: Fully Documented
pt_br: Completamente documentado

source: 100% Test Coverage
pt_br: 100% de cobertura de teste

source: Developed on Python 3.7
pt_br: Desenvolvido em Python 3.7

source: Tested on CPython 2.7, 3.4, 3.5, 3.6, and 3.7
pt_br: Testado em CPython 2.7, 3.4, 3.5, 3.6 e 3.7

source: Tested on Windows, Mac OS X, Raspbian (Raspberry Pi), and Linux
pt_br: Testado em Windows, Mac OS X, Raspbian (Raspberry Pi) e Linux

source: Tested using Travis CI and AppVeyor CI
pt_br: Testado usando Travis CI and AppVeyor CI

source: Quickstart
pt_br: Começo rápido

source: Installing Free Python Games is simple with `pip <https://pypi.python.org/pypi/pip>`_::
pt_br: Instalar o Free Python Games é simples com `pip:<https://pypi.python.org/pypi/pip>`_::

source: Free Python Games supports a command-line interface (CLI). Help for the CLI is available using::
pt_br: Free Python Games oferece suporte a uma interface de linha de comandos (CLI - Command Line Interface). A ajuda para a CLI está disponível usando::

source: The CLI supports three commands: list, copy, and show. For a list of all games run::
pt_br: A CLI suporta três comandos: list, copy e show. Para obter uma lista de todos os jogos, execute::

source: Any of the listed games may be played by executing the Python module from the command-line. To reference the Python module, combine "freegames" with the name of the game. For example, to play the "snake" game run::
pt_br: Qualquer um dos jogos listados pode ser jogado executando-se o módulo Python na linha de comando. Para fazer referência ao módulo Python, combine "freegames" com o nome do jogo. Por exemplo, para jogar o jogo "snake" execute::

source: Games can be modified by copying their source code. The copy command will create a Python file in your local directory which you can edit. For example, to copy and play the "snake" game run::
pt_br: Os jogos podem ser modificados copiando-se seu código fonte. O comando copy criará um arquivo Python, em seu diretório local, que você pode editar. Por exemplo, para copiar e jogar o jogo "snake" execute::

source: Python includes a built-in text editor named IDLE which can also execute Python code. To launch the editor and make changes to the "snake" game run::
pt_br: Python inclui um editor de texto integrado chamado IDLE, que também pode executar código Python. Para iniciar o editor e fazer alterações no jogo "snake" execute::

source: You can also access documentation in the interpreter with Python's built-in help function::
pt_br: Você também pode acessar a documentação no interpretador com a função embutida no Python help::

source: Free Games
pt_br: Jogos Livres

source: `Paint`_ -- draw lines and shapes on the screen. Click to mark the start of a shape and click again to mark its end. Different shapes and colors can be selected using the keyboard.
pt_br: `Paint`_ -- desenhe linhas e formas na tela. Clique para marcar o início e uma forma e clique novamente para marcar o seu final. Diferentes formas e cores podem ser selecionadas usando o teclado.

source: `Snake`_ -- classic arcade game. Use the arrow keys to navigate and eat the green food. Each time the food is consumed, the snake grows one segment longer. Avoid eating yourself or going out of bounds!
pt_br: `Snake`_ -- jogo de arcade clássico. Use as setas do teclado para navegar e comer a comida verde. Cada vez que o alimento é consumido, a cobra cresce um segmento a mais. Evite comer você mesmo ou bater nas bordas!

source: `Pacman`_ -- classic arcade game. Use the arrow keys to navigate and eat all the white food. Watch out for red ghosts that roam the maze.
pt_br: `Pacman`_ -- jogo de arcade clássico. Use as setas do teclado para navegar e comer toda a comida branca. Cuidado com os fantasmas vermelhos que vagam pelo labirinto.

source: Cannon
pt_br: Canhão

source: `Cannon`_ -- projectile motion. Click the screen to fire your cannnonball. The cannonball pops blue balloons in its path. Pop all the balloons before they can cross the screen.
pt_br: `Canhão`_ -- movimento de projétil. Clique na tela para disparar sua bala de canhão.A bala de canhão estoura balões azuis em seu caminho. Estoure todos os balões antes que eles possam cruzar a tela.

source: Cannon Free Python Game
pt_br: Canhão Free Python Game

source: `Connect`_ -- Connect 4 game. Click a row to drop a disc. The first player to connect four discs vertically, horizontally, or diagonally wins!
pt_br: `Connect`_ -- Jogo Ligue 4. Clique em uma linha para soltar um disco. O primeirojogador a conectar quatro discos verticalmente, horizontalmente ou diagonalmente vence!

source: `Flappy`_ -- Flappy-bird inspired game. Click the screen to flap your wings. Watch out for black ravens as you fly across the screen.
pt_br: `Flappy`_ -- Jogo inspirado em Flappy-bird. Clique na tela para bater suas asas. Cuidado com os corvos negros enquanto voa pela tela.

source: Memory
pt_br: Memória

source: `Memory`_ -- puzzle game of number pairs. Click a tile to reveal a number. Match two numbers and the tiles will disappear to reveal an image.
pt_br: `Memória`_ -- jogo de quebra-cabeça de pares de números. Clique em um ladrilho para revelar um número. Combine dois números e as peças desaparecerão para revelar uma imagem.

source: Memory Free Python Game
pt_br: Memória Free Python Game

source: `Pong`_ -- classic arcade game. Use the keyboard to move your paddle up and down. The first player to miss the ball loses.
pt_br: `Pong`_ -- jogo de arcade clássico. Use o teclado para mover a raquete para cima e para baixo. O primeiro jogador a perder a bola perde.

source: `Simon Says`_ -- classic memory puzzle game. Click the screen to start. Watch the pattern and then click the tiles in the same order. Each time you get the sequence right the pattern gets one step longer.
pt_br: `Simon Says`_ -- jogo clássico de quebra-cabeça de memória. Clique na tela para começar.Observe o padrão e clique nas peças na mesma ordem. Cada vez que você acerta a sequência, o padrão fica um passo mais longo.

source: Tic Tac Toe
pt_br: Jogo da Velha

source: `Tic Tac Toe`_ -- classic game. Click the screen to place an X or O. Connect three in a row and you win!
pt_br: `Jogo da Velha`_ -- jogo clássico. Clique na tela para colocar um X ou O. Conecte três em uma linha e você ganha!

source: Tic Tac Toe Free Python Game
pt_br: Jogo da Velha Free Python Game

source: `Tiles`_ -- puzzle game of sliding numbers into place. Click a tile adjacent to the empty square to swap positions. Can you make the tiles count one to fifteen from left to right and bottom to top?
pt_br: `Tiles`_ -- jogo de quebra-cabeça de números deslizantes. Clique em um ladrilho adjacente ao quadrado vazio para trocar de posição. Você pode fazer as peças contarem de um a quinze da esquerda para a direita e de baixo para cima?

source: `Tron`_ -- classic arcade game. Use the keyboard to change the direction of your Tron player. Avoid touching the line drawn by your opponent.
pt_br: `Tron`_ -- jogo clássico de arcade. Utilize o teclado para mudar a direção do seu jogador em Tron. Evite tocar na linha desenhada pelo seu oponente.

source: Life
pt_br: Jogo da vida

source: `Life`_ -- Conway's Game of Life. The classic, zero-player, cellular automation created in 1970 by John Conway.
pt_br: `Life`_ -- Jogo da vida de Conway. A clássica automação celular, zero-player, criada em 1970 por John Conway.

source: Game of Life Free Python Game
pt_br: Jogo da Vida Free Python Game

source: `Maze`_ -- move from one side to another. Inspired by `A Universe in One Line of Code with 10 PRINT`_. Tap the screen to trace a path from one side to another.
pt_br: `Maze`_ -- Mover de um lado para o outro. Inspirado por `A Universe in One Line of Code with 10 PRINT`_. Toque na tela para traçar um caminho de um lado para o outro.

source: `Fidget`_ -- fidget spinner inspired animation. Click the screen to accelerate the fidget spinner.
pt_br: `Fidget`_ -- Animação inspirada nos brinquedos fidget spinner. Clique na tela para acelerar o fidget spinner.

source: Fidget Spinner Free Python Game
pt_br: Fidget Free Python Game

source: User Guide
pt_br: Guia do Usuário

source: For those wanting more details, this part of the documentation describes curriculum, API, and development.
pt_br: Para aqueles que procuram mais detalhes, essa parte da documentação descreve o currículo, API, e desenvolvimento.

source: `Talk: Give the Gift of Python`_
pt_br: `Palestra: Dê o presente de Python`_

source: `Free Python Games Curriculum`_
pt_br: `Currículo Free Python Games`_

source: `Free Python Games API Reference`_
pt_br: `Referência da API do Free Python Games`_

source: `Free Python Games Development`_
pt_br: `Desenvolvimento do Free Python Games`_

source: References
pt_br: Referências

source: `Free Python Games Documentation`_
pt_br: `Documentação do Free Python Games`_

source: `Free Python Games at PyPI`_
pt_br: `Free Python Games no PyPI`_

source: `Free Python Games at GitHub`_
pt_br: `Free Python Games no GitHub`_

source: `Free Python Games Issue Tracker`_
pt_br: `Rastreador de issues do Free Python Games`_

source: Free Python Games License
pt_br: Licença do Free Python Games

source: Copyright 2017-2020 Grant Jenks
pt_br: Direitos autorais 2017 - 2020 Grant Jenks

source: Licensed under the Apache License, Version 2.0 (the "License"); you may not use this file except in compliance with the License. You may obtain a copy of the License at
pt_br: Licenciado pela licença Apache, Versão 2.0( A "Licença"); Você não pode usar esse documento exceto se estiver em concordância com a Licença. Pode obter a cópia da licença em

source: Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
pt_br: A menos que exigido pela lei aplicável ou acordado por escrito, o software distribuído sob a Licença é distribuído "COMO ESTÁ", SEM GARANTÍAS OU CONDIÇÕES DE QUALQUER TIPO, expressas ou implícitas. Consulte a licença para as permissões elimitações que regem o idioma específico sob a Licença.
